In [1]:
print('hello')

hello

In [4]:
#import pandas
import pandas as pd

In [15]:
#list
data = [1,24,5]
type(data)
data

[1, 24, 5]

In [16]:
#one-dimensional 
p = pd.Series(data)
p

0     1
1    24
2     5
dtype: int64

In [26]:
#two-dimensional array creating dataframe
dtaframe = pd.DataFrame(data,columns=['num'],index=['num1','num2','num3'])
dtaframe
# print(dtaframe.loc[0])

      num
num1    1
num2   24
num3    5

In [35]:
data1 = [ [1,2], [4,5],[6,7] ]

dtf = pd.DataFrame(data1,columns=['index1','index2'])
dtf

   index1  index2
0       1       2
1       4       5
2       6       7

In [ ]:
#Dictionary to pandas

In [39]:
data = {
    "name": ['alamin','sadiq'],
    "age" : [3,4]
}
data

{'name': ['alamin', 'sadiq'], 'age': [3, 4]}

In [41]:
num_series = pd.Series(data['name'],name='name')
num_series

0    alamin
1     sadiq
Name: name, dtype: object

In [46]:
dtf = pd.DataFrame(data)
dtf

     name  age
0  alamin    3
1   sadiq    4

In [45]:
age_series = dtf['age']
age_series

0    3
1    4
Name: age, dtype: int64

In [49]:
# set  series and dataframe
data = {1,2,3,4,5}
series = pd.Series(tuple(data))
series

dtf = pd.DataFrame(data)
dtf

   0
0  1
1  2
2  3
3  4
4  5

In [50]:
data = (1,2,4,5)
dtf = pd.DataFrame(data)
dtf

   0
0  1
1  2
2  4
3  5